In [1]:
import pandas as pd

In [11]:
x=pd.DataFrame([[1,2,3,4,5],[6,7,8,9,10]],index=[1,2],columns=["a","b","c","d","e"])
x

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [9]:
x.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 1 to 2
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
 3   d       2 non-null      int64
 4   e       2 non-null      int64
dtypes: int64(5)
memory usage: 96.0 bytes

In [10]:
x.describe()

              a         b         c         d          e
count  2.000000  2.000000  2.000000  2.000000   2.000000
mean   3.500000  4.500000  5.500000  6.500000   7.500000
std    3.535534  3.535534  3.535534  3.535534   3.535534
min    1.000000  2.000000  3.000000  4.000000   5.000000
25%    2.250000  3.250000  4.250000  5.250000   6.250000
50%    3.500000  4.500000  5.500000  6.500000   7.500000
75%    4.750000  5.750000  6.750000  7.750000   8.750000
max    6.000000  7.000000  8.000000  9.000000  10.000000

In [12]:
x.isnull()

       a      b      c      d      e
1  False  False  False  False  False
2  False  False  False  False  False

In [14]:
x.fillna(1)

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [15]:
x.duplicated()

1    False
2    False
dtype: bool

In [21]:
x.drop_duplicates()

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [19]:
sum(x.duplicated())

0

In [20]:
x.drop_duplicates()

   a  b  c  d   e
1  1  2  3  4   5
2  6  7  8  9  10

In [22]:
y=pd.DataFrame({'Rollno':[101,102,103],'Name':['gaurav','aasd','asdfadsf']});

In [23]:
y

   Rollno      Name
0     101    gaurav
1     102      aasd
2     103  asdfadsf

In [25]:
data=pd.read_csv('train_and_test2.csv')

In [26]:
data

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1305,1306,39.0,108.9000,1,0,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,0
1306,1307,38.5,7.2500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1307,1308,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1308,1309,28.0,22.3583,0,1,0,0,0,0,0,...,0,0,0,3,0,0,0.0,0,0,0